var RECYCLING_POINTS = [
  {
    acceptableRawTypes: ['plastic', 'paper', 'glass', 'metal'],
    lat: 49.810878,
    lng: 24.020105,
    description: 'вул. Персенківка 2 (бічна вул. Стрийської, Франківський р-н)\n' +
      '* плівку поліетиленову, ПЕТ-пляшки, пластмасу, біг-беги (мішки з поліпропілену).\n' +
      '* макулатуру\n' +
      '* склобій, склотару\n' +
      '* банки алюмінієві\n' +
      'Години роботи: Пн - Пт 8:00-17:00, Сб - 8:00-16:00, тел.: 068-2564503\n' +
      '(дані станом на жовтень 2016 року)',
  },
  {
    acceptableRawTypes: ['plastic', 'glass', 'paper'],
    lat: 49.815259,
    lng: 24.014142,
    description: 'вул. Лазаренка, 29 (район Податкової, бічна вул.Стрийської, Франківський р-н)\n' +
      '* плівку поліетиленову (стрейч, термо) - 6 гр/кг\n' +
      '* макулатура (крім яєчних лотків та шпалер) - 2,2 гр/кг\n' +
      '* склобій - 0,35 гр/кг\n' +
      '* ПЕТ-пляшки (вода, олія) - 2,5 гр/кг\n'+
      '* пластмаса: тазики, бочки, каністри; труби чорні; лом ящиків, відра, лотки, корзини; іграшки; кружки; флакони; меблі пластикові.\n' +
      'Все приймається в чистому і сухому вигляді.\n' +
      'Години роботи: Пн - Пт 8:00-16:00, Сб - 9:00-14:00, тел.: 063-0750467\n' +
      '(дані станом на листопад 2016 року)',
  },
  {
    acceptableRawTypes: ['glass', 'paper'],
    lat: 49.807656,
    lng: 24.016985,
    description: 'вул. В. Великого 34 (позаду кафе "Затишок", Франківський р-н)\n' +
      '* плівку поліетиленову, ПЕТ-пляшки, пластмасу, біг-беги (мішки з поліпропілену).\n' +
      '* макулатуру\n' +
      '* склобій, склотару\n' +
      '* банки алюмінієві\n' +
      'Години роботи: Пн - Пт 8:00-17:00, Сб - 8:00-16:00, тел.: 068-2564503\n' +
      '(дані станом на жовтень 2016 року)',
  },
  {
    acceptableRawTypes: ['plastic', 'paper'],
    lat: 49.859558,
    lng: 24.043563,
    description: 'вул. Промислова 27\n' +
      '* плівку поліетиленову\n' +
      '* пластик\n' +
      '* ПВХ\n' +
      '* макулатура',
  },
  {
    acceptableRawTypes: ['paper', 'glass'],
    lat: 49.829054,
    lng: 23.937564,
    description: 'вул. Конюшинна, 4 (район вул.Патона та вул.Городоцької), Залізничний р-н)\n' +
      '* плівку поліетиленову\n' +
      '* ПЕТ-пляшка\n' +
      '* склобій\n' +
      '* макулатура\n' +
      '(дані станом на грудень 2015 року)',
  },
  {
    acceptableRawTypes: ['plastic'],
    lat: 49.833901,
    lng: 23.982037,
    description: 'Кузневича, 4\n' +
      'ПОЛІЕТИЛЕНОВІ ПАКЕТИ, у хімчистку-праль ню "Profiчистка", яка є посередником (тому що на переробку приймають від 100 кг сировини.)',
  },
  {
    acceptableRawTypes: ['plastic', 'glass', 'paper'],
    lat: 49.831019,
    lng: 23.946927,
    description: 'вул. Данила Апостола 6а (Скнилівський міст, обласне МРЕВ, Залізничний р-н)\n' +
      '* PET-пляшку\n' +
      '* плівку поліетиленову та інші полімери\n' +
      '* скло (склобій)\n' +
      '* макулатура всіх видів\n' +
      'Години роботи: Пн - Пт 8:00-17:00  Тел.: 050-4432890\n' +
      'Також пропонується вивіз вторсировини власним транспортом.\n' +
      '(дані станом на грудень 2015 року, ТОВ «ВТОРМА-ЛЬВІВ» )\n',
  },
];

var getRecyclingPointsFor = function(rawType) {
  return RECYCLING_POINTS.filter(function(recyclingPoint) {
    return recyclingPoint.acceptableRawTypes.indexOf(rawType) !== -1;
  });
};

exports.default = RECYCLING_POINTS;

module.exports.getRecyclingPointsFor = getRecyclingPointsFor;
